// npm init -y
// npm i -D jest - в package.json добавляем скрипт запуска "test": "jest"

// Для примера - в папке validateValue создаем документ с функцией и документ с тестом для нее, еще пример jest в mapArrToStrings и square(пример с вложенным методом)
        // Запуск - npm run test (запустит все jest-тесты, если нужно конкретный - добавляем название документа)
        // Подробно методы на jestjs.io/docs/expect

// В папке delay тестируем асинхронную функцию

// npm i axios - устанавливаем для примера рабты с запросами

// В папке getData - пример тестирования функции с запросом